In [3]:
# Chapter 7: Data Cleaning and Preparation

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [11]:
float_data # NaN is a sentinel value: when present, it indicates a missing (or null) value.

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [13]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [23]:
string_data = pd.Series(["aardark", np.nan, None, "avocado"]) # NA refers to Missing data, which stands for not available.

In [33]:
string_data # The built-in Python None value is also treated as NA

0    aardark
1        NaN
2       None
3    avocado
dtype: object

In [21]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [27]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [29]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [31]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [35]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [37]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [39]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [41]:
# This is the same thing as doing:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [43]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [45]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [47]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [49]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [51]:
# These functions return new objects by default and do not modify the contents of the original object.

In [53]:
data[4] = np.nan

In [55]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [57]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [65]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [67]:
df

          0         1         2
0  0.633379 -0.188013 -0.101596
1 -0.621413  0.934805 -1.436407
2  2.245828 -0.394157  0.313533
3 -1.015369  1.679599  0.870040
4 -0.499889 -0.516297  0.242709
5 -1.078585  0.226359  0.654416
6  0.309446 -0.705697 -1.287513

In [69]:
df.iloc[:4, 1] = np.nan

In [71]:
df

          0         1         2
0  0.633379       NaN -0.101596
1 -0.621413       NaN -1.436407
2  2.245828       NaN  0.313533
3 -1.015369       NaN  0.870040
4 -0.499889 -0.516297  0.242709
5 -1.078585  0.226359  0.654416
6  0.309446 -0.705697 -1.287513

In [73]:
df.iloc[:2, 2] = np.nan

In [75]:
df

          0         1         2
0  0.633379       NaN       NaN
1 -0.621413       NaN       NaN
2  2.245828       NaN  0.313533
3 -1.015369       NaN  0.870040
4 -0.499889 -0.516297  0.242709
5 -1.078585  0.226359  0.654416
6  0.309446 -0.705697 -1.287513

In [77]:
df.dropna()

          0         1         2
4 -0.499889 -0.516297  0.242709
5 -1.078585  0.226359  0.654416
6  0.309446 -0.705697 -1.287513

In [81]:
df.dropna(thresh=2) # Keep only rows containing at most a certain number of missing observations.

          0         1         2
2  2.245828       NaN  0.313533
3 -1.015369       NaN  0.870040
4 -0.499889 -0.516297  0.242709
5 -1.078585  0.226359  0.654416
6  0.309446 -0.705697 -1.287513

In [83]:
df.fillna(0)

          0         1         2
0  0.633379  0.000000  0.000000
1 -0.621413  0.000000  0.000000
2  2.245828  0.000000  0.313533
3 -1.015369  0.000000  0.870040
4 -0.499889 -0.516297  0.242709
5 -1.078585  0.226359  0.654416
6  0.309446 -0.705697 -1.287513

In [85]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.633379  0.500000  0.000000
1 -0.621413  0.500000  0.000000
2  2.245828  0.500000  0.313533
3 -1.015369  0.500000  0.870040
4 -0.499889 -0.516297  0.242709
5 -1.078585  0.226359  0.654416
6  0.309446 -0.705697 -1.287513

In [87]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [89]:
df

          0         1         2
0 -0.708622 -0.358532  0.012731
1 -0.163665  0.138102  0.690906
2 -0.565765  0.061619 -0.085516
3  0.278933 -0.066694 -0.136896
4  1.265632  0.747721  0.333549
5 -0.911526  0.256441  0.034631

In [93]:
df.iloc[2:, 1] = np.nan

In [95]:
df

          0         1         2
0 -0.708622 -0.358532  0.012731
1 -0.163665  0.138102  0.690906
2 -0.565765       NaN -0.085516
3  0.278933       NaN -0.136896
4  1.265632       NaN  0.333549
5 -0.911526       NaN  0.034631

In [97]:
df.iloc[4:, 2] = np.nan

In [99]:
df

          0         1         2
0 -0.708622 -0.358532  0.012731
1 -0.163665  0.138102  0.690906
2 -0.565765       NaN -0.085516
3  0.278933       NaN -0.136896
4  1.265632       NaN       NaN
5 -0.911526       NaN       NaN

In [103]:
df.fillna(method="ffill") # forward fill

D:\TEMP\ipykernel_13520\2535960854.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill") # forward fill

          0         1         2
0 -0.708622 -0.358532  0.012731
1 -0.163665  0.138102  0.690906
2 -0.565765  0.138102 -0.085516
3  0.278933  0.138102 -0.136896
4  1.265632  0.138102 -0.136896
5 -0.911526  0.138102 -0.136896

In [105]:
df.fillna(method="ffill", limit=2)

D:\TEMP\ipykernel_13520\1627181726.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.708622 -0.358532  0.012731
1 -0.163665  0.138102  0.690906
2 -0.565765  0.138102 -0.085516
3  0.278933  0.138102 -0.136896
4  1.265632       NaN -0.136896
5 -0.911526       NaN -0.136896

In [107]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [109]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [111]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [5]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})

In [7]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [9]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [11]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [13]:
data["v1"] = range(7)

In [15]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [17]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [23]:
# "duplicated" and "drop_duplicates" by default keep the first observed value combi|nation. 
# Passing keep="last" will return the last one
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [25]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [27]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [29]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [31]:
data["animal"] = data["food"].map(meat_to_animal)

In [33]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [35]:
def get_animal(x):
    return meat_to_animal[x]

In [37]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [39]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [41]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64